In [1]:
import pandas as pn

In [2]:
import numpy as np

## Data series - Numpy array,Dictionaries

In [3]:
a=['EEE','civil','mech','cse','IT']
data=pn.Series(a)
data

0      EEE
1    civil
2     mech
3      cse
4       IT
dtype: object

In [5]:
b=np.array([1,2,3,4])
d=pn.Series(b)
d

0    1
1    2
2    3
3    4
dtype: int32

In [6]:
dic={'1':'EEE','2':'CSE','3':'IT'}
dd=pn.Series(dic)
dd

1    EEE
2    CSE
3     IT
dtype: object

## Data Frame - Numpy array,Dictionaries

In [11]:
df=[12,13,14]
d=pn.DataFrame(df,columns=['df'],index=['a','b','c'])
d

   df
a  12
b  13
c  14

In [41]:
inp={"Prasu":['EEE',6,75],"Vasu":['CSE',68,74],"Anshu":['CSE',67,75]}
d=pn.DataFrame(inp,index=range(32,38,2))
d

   Prasu Vasu Anshu
32   EEE  CSE   CSE
34     6   68    67
36    75   74    75

## Getting index,values

In [42]:
d.index

RangeIndex(start=32, stop=38, step=2)

In [43]:
d.values

array([['EEE', 'CSE', 'CSE'],
       [6, 68, 67],
       [75, 74, 75]], dtype=object)

In [44]:
d.Prasu

32    EEE
34      6
36     75
Name: Prasu, dtype: object

In [49]:
d[['Prasu','Vasu','Anshu']]

   Prasu Vasu Anshu
32   EEE  CSE   CSE
34     6   68    67
36    75   74    75

In [51]:
d['Prasu'][32]

'EEE'

## Using NumPy functions : using masking, mathematics

In [97]:
inp={'a':[1,2,3,4,5],'b':[0.1,0.2,34,87,9]}
d=pn.DataFrame(inp)
d

   a     b
0  1   0.1
1  2   0.2
2  3  34.0
3  4  87.0
4  5   9.0

In [94]:
s=d[d>1]
s

     a     b
0  NaN   NaN
1  2.0   NaN
2  3.0  34.0
3  4.0  87.0
4  5.0   9.0

In [95]:
[d>1]

[       a      b
 0  False  False
 1   True  False
 2   True   True
 3   True   True
 4   True   True]

In [96]:
d>1

       a      b
0  False  False
1   True  False
2   True   True
3   True   True
4   True   True

## isnull, pd.notnull

In [64]:
d.isnull()

       a      b
0  False  False
1  False  False
2  False  False
3  False  False
4  False  False

In [65]:
s.isnull()

       a      b
0   True   True
1  False   True
2  False  False
3  False  False
4  False  False

In [66]:
s.notnull()

       a      b
0  False  False
1   True  False
2   True   True
3   True   True
4   True   True

In [67]:
pn.notnull(s)

       a      b
0  False  False
1   True  False
2   True   True
3   True   True
4   True   True

In [68]:
s

     a     b
0  NaN   NaN
1  2.0   NaN
2  3.0  34.0
3  4.0  87.0
4  5.0   9.0

## count of missing values

In [69]:
s.isnull().sum()

a    1
b    2
dtype: int64

In [91]:
s[s==5].count()

a    1
b    0
dtype: int64

## df.head(), df.sample(),df.tail()

In [98]:
d.head()

   a     b
0  1   0.1
1  2   0.2
2  3  34.0
3  4  87.0
4  5   9.0

In [99]:
d.head(2)

   a    b
0  1  0.1
1  2  0.2

In [100]:
d.tail()

   a     b
0  1   0.1
1  2   0.2
2  3  34.0
3  4  87.0
4  5   9.0

In [117]:
d.sample(4)

   a     b
4  5   9.0
3  4  87.0
1  2   0.2
0  1   0.1

## creating columns and index values

In [120]:
d["c"]=[9,56,4,6,2]
d

   a     b   c
0  1   0.1   9
1  2   0.2  56
2  3  34.0   4
3  4  87.0   6
4  5   9.0   2

In [124]:
d.drop(['a'],axis=1)      ### axis=1 for row axis=0 for columns

      b   c
0   0.1   9
1   0.2  56
2  34.0   4
3  87.0   6
4   9.0   2

## Reindexing

In [130]:
d.reindex([range(1,6)])

                  a   b   c
(1, 2, 3, 4, 5) NaN NaN NaN

In [129]:
d

   a     b   c
0  1   0.1   9
1  2   0.2  56
2  3  34.0   4
3  4  87.0   6
4  5   9.0   2

## Selection with loc and iloc

In [137]:
i={"Prasu":['EEE',6,75],"Vasu":['CSE',68,74],"Anshu":['CSE',67,75]}
d=pn.DataFrame(i,index=range(32,38,2))
d

   Prasu Vasu Anshu
32   EEE  CSE   CSE
34     6   68    67
36    75   74    75

In [138]:
inp={"Prasuna":['EEE',6,75],"Vas":['CSE',68,74],"Anu":['CSE',67,75]}
d1=pn.DataFrame(inp,index=range(30,36,2))
d1

   Prasuna  Vas  Anu
30     EEE  CSE  CSE
32       6   68   67
34      75   74   75

In [139]:
d+d1

   Anshu  Anu Prasu Prasuna  Vas Vasu
30   NaN  NaN   NaN     NaN  NaN  NaN
32   NaN  NaN   NaN     NaN  NaN  NaN
34   NaN  NaN   NaN     NaN  NaN  NaN
36   NaN  NaN   NaN     NaN  NaN  NaN